case2D_source/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293.15;

boundaryField
{
    ".*Empty"
    {
        type            empty;
    }

    roomWall
    {
        type            fixedValue;
        value           $internalField;
    }

    defaultWall
    {
        type            fixedValue;
        value           $internalField;
    }

    cabinetWall
    {
        type            fixedValue;
        value           uniform 323.15; // 50 degC
    }

    inlet
    {
        type            fixedValue;
        value 	        uniform 293.15;
    }

    outlet
    {
        type            zeroGradient;
    }

}

// ************************************************************************* //
