case2D_source/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    ".*Empty"
    {
        type            empty;
    }

    // ".*Wall"
    // {
    //     type            calculated;
    //     value           $internalField;
    // }

    // inlet
    // {
    //     type            calculated;
    //     value           $internalField;
    // }

    // outlet
    // {
    //     type            calculated;
    //     value           $internalField;
    // }

    ".*Wall"
    {
        type            zeroGradient;
    }

    inlet
    {
        type            zeroGradient;
        // type            fixedValue;
        // value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
        // type            fixedValue;
        // value           $internalField;
    }
}

// ************************************************************************* //
