case2D_source/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        "system";
    object          sample;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs            ("libsampling.so");

interpolationScheme cellPointFace;

setFormat raw;

sets
(
    y0.1
    {
        type            lineFace;
        axis            z;
        start           (1.6 0.05 0.01);
        end             (1.6 0.05 1.99);
        nPoints         20;
    }
    // y0.2
    // {
    //     type            lineFace;
    //     axis            x;
    //     start           (-1 0.436 0);
    //     end             (1 0.436 0);
    // }
    // y0.3
    // {
    //     type            lineFace;
    //     axis            x;
    //     start           (-1 0.654 0);
    //     end             (1 0.654 0);
    // }
    // y0.4
    // {
    //     type            lineFace;
    //     axis            x;
    //     start           (-1 0.872 0);
    //     end             (1 0.872 0);
    // }
    // y0.5
    // {
    //     type            lineFace;
    //     axis            x;
    //     start           (-1 1.09 0);
    //     end             (1 1.09 0);
    // }
    // y0.6
    // {
    //     type            lineFace;
    //     axis            x;
    //     start           (-1 1.308 0);
    //     end             (1 1.308 0);
    // }
    // y0.7
    // {
    //     type            lineFace;
    //     axis            x;
    //     start           (-1 1.526 0);
    //     end             (1 1.526 0);
    // }
    // y0.8
    // {
    //     type            lineFace;
    //     axis            x;
    //     start           (-1 1.744 0);
    //     end             (1 1.744 0);
    // }
    // y0.9
    // {
    //     type            lineFace;
    //     axis            x;
    //     start           (-1 1.962 0);
    //     end             (1 1.962 0);
    // }
);

fields
(
    T
    U
);


// ************************************************************************* //
