case2D_source/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    inlet;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box   (3.999 0 3.0)(4.001 0.1 3.5);
        }
    }
    {
        name    outlet;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box   (-0.001 0 3.0)(0.001 0.1 3.5);
        }
    }
    
    {
       name CPU;		
       type    cellSet;
       action  new;
       source  boxToCell;
       sourceInfo
       {
         box (1 0 0 ) (1.5 0.1 2);
       }
    }
);

// ************************************************************************* //
